import { isValidValue } from "element-plus/es/components/tree-select/src/utils.mjs";

const Data = {
    data: [
        {
            name1: "电脑 ",
            name2: " 办公 ",
            name3:" 文具",
            icon:"Tv",
            arr: [
                {
                    name: "淘宝热点",
                    arr: ['拒绝腱鞘炎电脑手托']
                },
                {
                    name: '电脑整机',
                    arr: ['笔记本电脑', '游戏本', '平板电脑', 'DIY电脑', '服务器/工作站', '一体机', '闺蜜机']
                },
                {
                    name: '电脑配件',
                    arr: ['显示器', 'CPU', '主板', '显卡', '硬盘', '内存', '机箱', '散热器', '电源', '显示器支架', '光驱', '声卡', '装机配件', 'SSD固态硬盘', '组装电脑', 'USB分线器', '主板CPU']
                },
                {
                    name: '外设产品',
                    arr: ['鼠标','键盘','网络仪表仪器','U盘','移动硬盘','摄像头','手写板','UPS电源','平板电脑配件','笔记本配件','投屏器','扩展坞']
                },
                {
                    name: '游戏设备',
                    arr: ['游戏机','游戏耳机','游戏软件','手柄/方向盘','游戏周边','游戏手办']
                },                                                       
                {
                    name: '网络产品',                               
                    arr: ['路由器','网络机顶盒','交换机','网络存储','网卡','5G/4G上网','网线','网络配件']
                },
                {
                    name: '办公设备',
                    arr: ['投影机','打印机','传真设备','碎纸机','收银机','保险柜','安防监控']
                },
                {
                    name: '办公耗材',
                    arr: ['墨粉', '墨盒', '色带', '刻录光盘', '电脑打印纸', '条码','纸类','标签纸','收银纸','卡纸']
                },
                {
                    name: '财务办公',
                    arr: ['订书机','票夹','美工刀','胶带','复写纸','大头针','号码机','印泥','账本','计算器']
                },
                {
                    name: '书写工具',
                    arr: ['钢笔','记号笔','荧光笔','油漆笔','秀丽笔','笔芯','圆珠笔','中性笔','铅笔']
                },
                {
                    name: '本册纸签',
                    arr: ['记事本','日记本','作业本','手帐','教学用本','纪念册','索引纸','文稿纸','相册','明信片']
                },
                {
                    name: '学习用品',
                    arr: ['卷笔刀','练字帖','拼音机口算机','橡皮擦','修正带','阅读架','文具盒','地球仪']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                }
            ]
        },
        {
            name1: "家电 ",
            name2: "手机 ",
            name3:" 数码",
            icon:"Phone",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: "家具 ",
            name2: " 家装 ",
            name3:" 家居",
            icon:"Home",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '女装 ',
            name2: " 男装 ",
            name3:" 内衣",
            icon:"Suit",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '女鞋 ',
            name2: " 男鞋 ",
            name3:" 运动",
            icon:"Shoes",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '腕表 ',
            name2: " 珠宝 ",
            name3:" 配饰",
            icon:"Gift",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '汽车 ',
            name2: " 车载 ",
            name3:" 出行",
            icon:"Car",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                }
            ]
        },
        {
            name1: '食品 ',
            name2: " 生鲜 ",
            name3:" 健康",
            icon:"Box",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '母婴 ',
            name2: " 童装 ",
            name3:" 潮玩",
            icon:"Play",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '美妆 ',
            name2: " 洗护 ",
            name3:" 宠物",
            icon:"Wash",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '娱乐 ',
            name2: " 图书 ",
            name3:" 鲜花",
            icon:"Book",
            arr: [
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        }
    ]
};

export default defineEventHandler(() => {
    return Data;
});