const headerData = {
    data:[
        '男童酷帅夏装',
        '小众独特连衣裙',
        '电流生发梳',
        '厨房吸油机',
        '今年流行的新款凉鞋',
        '短袖仙气上衣',
        '红光头皮生发梳',
        '七星漂线组', 
        '盐系高级感连衣裙',
        '配仙女裙子鞋',
        '格力空调遥控器',
        '生发梳',
        '老奶奶夏装套装',
        '高端儿童电动车',
        '夏季沙发垫',
        '绿豆糕包装盒',
        '小米净水器滤芯',
        '少女纯棉短袖t恤',
        '法式温柔凉鞋',
        '男孩儿童泳衣',
        '盐系风格穿搭',
        '红光头皮生发梳',
        '无叶挂脖风扇',
        '普拉提短款衬衫',
        '小众独特连衣裙',
        '电流生发梳',
        '路亚竿套装',
        '短袖仙气上衣',
        '微电流生发梳',
        '厨房吸油机',
        '防密脱生发梳',
        '七星漂线组'
    ]
};

export default defineEventHandler(() => {
    return headerData;
});