export const listData = {
    data: [
        {
            name1: "电脑 ",
            id1: 'bb',
            name2: " 办公 ",
            id2: 'gg',
            name3: " 文具",
            id3: 'jj',
            icon:"Tv",
            arr: [
                {
                    name: "淘宝热点",
                    arr: ['拒绝腱鞘炎电脑手托'],
                    id:"aa"
                },
                {
                    name: '电脑整机',
                    arr: ['笔记本电脑', '游戏本', '平板电脑', 'DIY电脑', '服务器/工作站', '一体机', '闺蜜机'],
                    id:"bb"
                },
                {
                    name: '电脑配件',
                    arr: ['显示器', 'CPU', '主板', '显卡', '硬盘', '内存', '机箱', '散热器', '电源', '显示器支架', '光驱', '声卡', '装机配件', 'SSD固态硬盘', '组装电脑', 'USB分线器', '主板CPU'],
                    id:'cc'
                },
                {
                    name: '外设产品',
                    arr: ['鼠标', '键盘', '网络仪表仪器', 'U盘', '移动硬盘', '摄像头', '手写板', 'UPS电源', '平板电脑配件', '笔记本配件', '投屏器', '扩展坞'],
                    id:'dd'
                },
                {
                    name: '游戏设备',
                    arr: ['游戏机', '游戏耳机', '游戏软件', '手柄/方向盘', '游戏周边', '游戏手办'],
                    id:'ee'
                },                                                       
                {
                    name: '网络产品',                               
                    arr: ['路由器', '网络机顶盒', '交换机', '网络存储', '网卡', '5G/4G上网', '网线', '网络配件'],
                    id:'ff'
                },
                {
                    name: '办公设备',
                    arr: ['投影机', '打印机', '传真设备', '碎纸机', '收银机', '保险柜', '安防监控'],
                    id:'gg'
                },
                {
                    name: '办公耗材',
                    arr: ['墨粉', '墨盒', '色带', '刻录光盘', '电脑打印纸', '条码', '纸类', '标签纸', '收银纸', '卡纸'],
                    id:'hh'
                },
                {
                    name: '财务办公',
                    arr: ['订书机', '票夹', '美工刀', '胶带', '复写纸', '大头针', '号码机', '印泥', '账本', '计算器'],
                    id:'ii'
                },
                {
                    name: '书写工具',
                    arr: ['钢笔', '记号笔', '荧光笔', '油漆笔', '秀丽笔', '笔芯', '圆珠笔', '中性笔', '铅笔'],
                    id:'jj'
                },
                {
                    name: '本册纸签',
                    arr: ['记事本', '日记本', '作业本', '手帐', '教学用本', '纪念册', '索引纸', '文稿纸', '相册', '明信片'],
                    id:'kk'
                },
                {
                    name: '学习用品',
                    arr: ['卷笔刀', '练字帖', '拼音机口算机', '橡皮擦', '修正带', '阅读架', '文具盒', '地球仪'],
                    id:'ll'
                },
                {
                    name: '绘画书法',
                    arr: ['画纸', '颜料画笔', '勾线笔', '蜡笔', '画架', '文房', '套装', '砚台', '毛笔', '字帖', '宣纸'],
                    id:'mm'
                }
            ]
        },
        {
            name1: "家电 ",
            id1: 'aa',
            name2: "手机 ",
            id2: 'ff',
            name3: " 数码",
            id3:'jj',
            icon:"Phone",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'cc',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'dd',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'ee',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'ff',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'gg',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'hh',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'ii',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    id:'jj',
                    name: '绘画书法',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: "家具 ",
            id1:'aa',
            name2: " 家装 ",
            id2:'dd',
            name3: " 家居",
            id3:'ee',
            icon:"Home",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '女装 ',
            id1:'bb',
            name2: " 男装 ",
            id2:'cc',
            name3: " 内衣",
            id3: 'ff',
            icon:"Suit",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ff',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '女鞋 ',
            id1:'aa',
            name2: " 男鞋 ",
            id2: 'cc',
            name3: " 运动",
            id3: 'ee',
            icon:"Shoes",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ff',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '腕表 ',
            id1:'aa',
            name2: " 珠宝 ",
            id2: 'bb',
            name3: " 配饰",
            id3:'cc',
            icon:"Gift",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '汽车 ',
            id1: 'aa',
            name2: " 车载 ",
            id2: 'bb',
            name3: " 出行",
            id3: 'cc',
            icon:"Car",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                }
            ]
        },
        {
            name1: '食品 ',
            id1: 'aa',
            name2: " 生鲜 ",
            id2: 'bb',
            name3: " 健康",
            id3: 'ee',
            icon:"Box",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '母婴 ',
            id1: 'aa',
            name2: " 童装 ",
            id2: 'bb',
            name3: " 潮玩",
            id3: 'cc',
            icon:"Play",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '美妆 ',
            id1:'aa',
            name2: " 洗护 ",
            id2: 'cc',
            name3: " 宠物",
            id3: 'ee',
            icon:"Wash",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        },
        {
            name1: '娱乐 ',
            id1: 'aa',
            name2: " 图书 ",
            id2: 'ee',
            name3: " 鲜花",
            id3: 'ff',
            icon:"Book",
            arr: [
                {
                    name: '绘画书法',
                    id:'aa',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'bb',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'cc',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'dd',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ee',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
                {
                    name: '绘画书法',
                    id:'ff',
                    arr: ['画纸','颜料画笔','勾线笔','蜡笔','画架','文房','套装','砚台','毛笔','字帖','宣纸']
                },
            ]
        }
    ]
}
